#!/bin/bash

port=7777
allThreads=(
185.169.134.3
185.169.134.4
185.169.134.43
185.169.134.44
185.169.134.45
185.169.134.5
185.169.134.59
185.169.134.61
185.169.134.107
185.169.134.109
185.169.134.166
185.169.134.171
185.169.134.172
185.169.134.173
185.169.134.174
80.66.82.191
80.66.82.190
80.66.82.188
80.66.82.168
80.66.82.159
80.66.82.200
80.66.82.144
80.66.82.132
80.66.82.128
80.66.82.113
80.66.82.82
80.66.82.87
80.66.82.54
80.66.82.39
80.66.82.33
)

echo -e "Введите номер сервера на котором хотите играть: "
read number
echo -e "Ник ввел быстро: "
read -s nickname
cd ~/.wine/dosdevices/c:/GAMES/ARIZONA\ GAMES/bin/Arizona/
./gta_sa.exe -arizona -c -h ${allThreads[$number]} -p $port -mem 4096 -n $nickname -x
